from aiogram import types
from aiogram.dispatcher.filters import CommandHelp

from loader import dispatcher


@dispatcher.message_handler(CommandHelp())
async def bot_help(message: types.Message):
    await message.answer('/init — инициализация, начало записи в базу (доступно администраторам или владельцам); \n'
                         '/description — инструкция о том, как оформлять сообщения, описание проблем; \n'
                         '/records — запросить статистику по сообщениям (доступно администраторам или владельцам); \n'
                         '/add_admins — добавить пользователей с <code>user_id</code> в список '
                         'администраторов (доступно только владельцам); \n'
                         '/remove_admins — исключить пользователей с <code>user_id</code> из списка администраторов '
                         '(доступно только владельцам); \n'
                         '/add_users — добавить пользователей с <code>user_id</code> в список операторов. '
                         'Сообщения операторов в чате не удаляются (доступно администраторам или владельцам); \n'
                         '/remove_users — исключить пользователей с <code>user_id</code> из списка операторов '
                         '(доступно администраторам или владельцам); \n'
                         '/list_admins — посмотреть список администраторов в чате '
                         '(доступно администраторам или владельцам); \n'
                         '/list_users — посмотреть список операторов в чате '
                         '(доступно администраторам или владельцам); \n'
                         '/help — прочитать это сообщение ещё раз. \n'
                         '\n'
                         'Если что-то идет не так и вы не понимаете, как такое возможно, '
                         'пожалуйста, напишите @arthur_dzhemakulov.')
